#include <iostream>

using namespace std;

/*  2: 10                                                                           1
 *  3: 100 101                                                                      2
 *  4: 1000 1001 1010                                                               3
 *  5: 10000 10001 10010 10100 10101                                                5
 *  6: 100000 100001 100010 100100 100101 101000 101010                             8
 *  7: 1000000 1000001 1000010 1000101 1001000 1001010 1010000 1010001 1010010 
 *
 * */
long long int arr[1001];
int main() {
    int n;
    cin >> n;

    // 11 연속 안됨
    // 그리고 첫자리 1이어야 함 
    arr[1] = 1;
    arr[2] = 1;
    arr[3] = 2;
    for (int i = 4; i <= n; i++) {
        arr[i] = arr[i-1] + arr[i-2];
    }
    cout << arr[n] << endl;
    return 0;
}
